tkashi-github/IMXRT1060-EVK/IMXRT1060-EVK_APL/source/UserDriver/SAI/DrvSAI.c
/**
 * @brief		SAI Driver wrapper
 * @author		Takashi Kashiwagi
 * @date		2019/06/13
 * @version     0.1
 * @details 
 * --
 * License Type <MIT License>
 * --
 * Copyright 2019 Takashi Kashiwagi
 * 
 * Permission is hereby granted, free of charge, to any person obtaining a 
 * copy of this software and associated documentation files (the "Software"), 
 * to deal in the Software without restriction, including without limitation 
 * the rights to use, copy, modify, merge, publish, distribute, sublicense, 
 * and/or sell copies of the Software, and to permit persons to whom the 
 * Software is furnished to do so, subject to the following conditions:
 * The above copyright notice and this permission notice shall be included 
 * in all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE 
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER 
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING 
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER 
 * DEALINGS IN THE SOFTWARE.
 *
 * @par Update:
 * - 2019/06/13: Takashi Kashiwagi: v0.1 for IMXRT1060-EVK
 */
#ifndef __cplusplus
#if __STDC_VERSION__ < 201112L
#error
#endif
#endif

#include "SAI/DrvSAI.h"
#include "OSResource.h"
#include "fsl_wm8960.h"
#include "pin_mux.h"
#include "board.h"
#include "clock_config.h"
#include "mimiclib/source/mimiclib.h"
#include "SoundTask/SoundTask.h"

#define kOverSampleRate (384U)

/* DMA */
#define kDMA DMA0
#define kDMAMUX DMAMUX

/* Select USB1 PLL (480 MHz) as master lpi2c clock source */
#define kLPI2CClockSourceSelect (0U)
/* Clock divider for master lpi2c clock source */
#define kLPI2CClockSourceDivider (5U)

static void txCallback(I2S_Type *base, sai_edma_handle_t *handle, status_t status, void *userData);
static void rxCallback(I2S_Type *base, sai_edma_handle_t *handle, status_t status, void *userData);

alignas(4) static uint8_t s_TxAudioBuff[enNumOfSAI][DEF_AUDIO_BUFFER_SIZE] __attribute__((section(".NonCacheable")));
alignas(4) static uint8_t s_RxAudioBuff[enNumOfSAI][DEF_AUDIO_BUFFER_SIZE] __attribute__((section(".NonCacheable")));

/**  */
static volatile uint32_t s_u32EDMATxBufSize[enNumOfSAI] = {
	DEF_BUFFER_SAMPLE_SIZE * sizeof(uint32_t), 
	DEF_BUFFER_SAMPLE_SIZE * sizeof(uint32_t),
};
static volatile uint32_t s_u32BeginCount[enNumOfSAI] = {0};
static volatile uint32_t s_u32SendCount[enNumOfSAI] = {0};
static volatile uint32_t s_u32TxEmptyBlock[enNumOfSAI] = {DEF_BUFFER_QUEUE_SIZE, DEF_BUFFER_QUEUE_SIZE};

static volatile uint32_t s_u32EDMARxBufSize[enNumOfSAI] = {
	DEF_BUFFER_SAMPLE_SIZE * sizeof(uint32_t), 
	DEF_BUFFER_SAMPLE_SIZE * sizeof(uint32_t),
};
static _Atomic uint32_t s_u32FullBlock[enNumOfSAI] = {0};
static volatile _Bool s_bIsTxFinished[enNumOfSAI] = {false};
static volatile _Bool s_bIsRxFinished[enNumOfSAI] = {false};

/** Chacheなしエリアへの配置 */
alignas(256) static __attribute__((section("NonCacheable.init"))) sai_edma_handle_t s_stSAI1Es_hndDmaTx = {0};
alignas(256) static __attribute__((section("NonCacheable.init"))) sai_edma_handle_t s_stSAI2Es_hndDmaTx = {0};
//alignas(256) static __attribute__((section("NonCacheable.init"))) sai_edma_handle_t s_stSAI3Es_hndDmaTx = {0};
alignas(256) static __attribute__((section("NonCacheable.init"))) sai_edma_handle_t s_stSAI1Es_hndDmaRx = {0};
alignas(256) static __attribute__((section("NonCacheable.init"))) sai_edma_handle_t s_stSAI2Es_hndDmaRx = {0};
//alignas(256) static __attribute__((section("NonCacheable.init"))) sai_edma_handle_t s_stSAI3Es_hndDmaRx = {0};

static uint32_t s_u32Index[enNumOfSAI] = {0};
static uint32_t s_u32ReadIndex[enNumOfSAI] = {0};

/**  */
static sai_edma_handle_t *s_phndSaiDmaTx[enNumOfSAI] = {
	&s_stSAI1Es_hndDmaTx,
	&s_stSAI2Es_hndDmaTx,
};
static sai_edma_handle_t *s_phndSaiDmaRx[enNumOfSAI] = {
	&s_stSAI1Es_hndDmaRx,
	&s_stSAI2Es_hndDmaRx,
};

static edma_handle_t s_hndDmaTx[enNumOfSAI] = {0};
static edma_handle_t s_hndDmaRx[enNumOfSAI] = {0};
static const uint32_t kDmaTxChannel[enNumOfSAI] = {12, 14};
static const uint32_t kDmaRxChannel[enNumOfSAI] = {13, 15};
static const dma_request_source_t s_DmaRequestMuxSaiTx[enNumOfSAI] = {
	kDmaRequestMuxSai1Tx,
	kDmaRequestMuxSai2Tx,
};
static const dma_request_source_t s_DmaRequestMuxSaiRx[enNumOfSAI] = {
	kDmaRequestMuxSai1Rx,
	kDmaRequestMuxSai2Rx,
};

/*******************************************************************************
 * Code
 ******************************************************************************/

/*
 * AUDIO PLL setting: Frequency = CrystalFref * (DIV_SELECT + NUM / DENOM)
 *                              = 24000000 * (loopDivider + numerator/denominator)
 *                              = 786432000 Hz
 */
static const clock_audio_pll_config_t audioPllConfig786432000Hz = {
	.loopDivider = 32,  /* PLL loop divider. Valid range for DIV_SELECT divider value: 27~54. */
	.postDivider = 1,   /* Divider after the PLL, should only be 1, 2, 4, 8, 16. */
	.numerator = 96,	/* 30 bit numerator of fractional loop divider. */
	.denominator = 125, /* 30 bit denominator of fractional loop divider */
};
/*
 * AUDIO PLL setting: Frequency = CrystalFref * (DIV_SELECT + NUM / DENOM)
 *                              = 24000000 * (loopDivider + numerator/denominator)
 *                              = 722534400 Hz
 */
static const clock_audio_pll_config_t audioPllConfig722534400Hz = {
	.loopDivider = 30,  /* PLL loop divider. Valid range for DIV_SELECT divider value: 27~54. */
	.postDivider = 1,   /* Divider after the PLL, should only be 1, 2, 4, 8, 16. */
	.numerator = 66,	/* 30 bit numerator of fractional loop divider. */
	.denominator = 625, /* 30 bit denominator of fractional loop divider */
};
/* Select Audio/Video PLL (786.48 MHz) as sai clock source */
#define kSAIClockSourceSelect (2U)
/* Clock pre divider for sai clock source */
#define kSAIClockSourcePreDivider (0U)
/* Clock divider for sai clock source */
#define kSAIClockSourceDivider (63U)

