tkashi-github/IMXRT1060-EVK/IMXRT1060-EVK_APL/source/UserDriver/SAI/DrvSAI.c
/* Get frequency of sai clock */
#define kSAIClockFreq                                                    \
	(CLOCK_GetFreq(kCLOCK_AudioPllClk) / (kSAIClockSourceDivider + 1U) / \
	 (kSAIClockSourcePreDivider + 1U))

static _Bool EnableSaiMclkOutput(enSAI_t enSAI, _Bool enable)
{
	uint32_t mask[] = {
		IOMUXC_GPR_GPR1_SAI1_MCLK_DIR_MASK,
		IOMUXC_GPR_GPR1_SAI2_MCLK_DIR_MASK,
		IOMUXC_GPR_GPR1_SAI3_MCLK_DIR_MASK,
	};

	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return false;
	}

	if (enable)
	{
		IOMUXC_GPR->GPR1 |= mask[enSAI];
	}
	else
	{
		IOMUXC_GPR->GPR1 &= (~mask[enSAI]);
	}
	return true;
}

static void txCallback(I2S_Type *base, sai_edma_handle_t *handle, status_t status, void *userData)
{
	enSAI_t enSAI;

	if (base == SAI1)
	{
		enSAI = enSAI1;
	}
	else if (base == SAI2)
	{
		enSAI = enSAI2;
	}
	else
	{
		return;
	}

	s_u32SendCount[enSAI]++;

	if (s_u32SendCount[enSAI] == s_u32BeginCount[enSAI])
	{ /** すべて転送した */
		DrvSAIImmidiateTxStop(enSAI);
		PostMsgSoundTaskStop(enSAI, __func__, __LINE__);
	}
	else
	{
		s_u32TxEmptyBlock[enSAI]++;
		osEventFlagsSet(g_efSAITx[enSAI], 1);
	}
}

static void rxCallback(I2S_Type *base, sai_edma_handle_t *handle, status_t status, void *userData)
{
	enSAI_t enSAI;

	if (base == SAI1)
	{
		enSAI = enSAI1;
	}
	else if (base == SAI2)
	{
		enSAI = enSAI2;
	}
	else
	{
		return;
	}

	if (s_u32FullBlock[enSAI] >= DEF_BUFFER_QUEUE_SIZE)
	{
		/** オーバーランした */
		DrvSAIImmidiateRxStop(enSAI);
		PostMsgSoundTaskStop(enSAI, __func__, __LINE__);
	}
	else
	{
		s_u32FullBlock[enSAI]++;
		osEventFlagsSet(g_efSAIRx[enSAI], 1);
	}
}

static void SAI_UserTxIRQHandler(I2S_Type *base)
{
	/* Clear the FEF flag */
	SAI_TxClearStatusFlags(base, kSAI_FIFOErrorFlag);
	SAI_TxSoftwareReset(base, kSAI_ResetTypeFIFO);
}

static void SAI_UserRxIRQHandler(I2S_Type *base)
{
	SAI_RxClearStatusFlags(base, kSAI_FIFOErrorFlag);
	SAI_RxSoftwareReset(base, kSAI_ResetTypeFIFO);
}

void SAI1_IRQHandler(void)
{
	if (SAI1->TCSR & kSAI_FIFOErrorFlag)
	{
		SAI_UserTxIRQHandler(SAI1);
	}

	if (SAI1->RCSR & kSAI_FIFOErrorFlag)
	{
		SAI_UserRxIRQHandler(SAI1);
	}
}
void SAI2_IRQHandler(void)
{
	if (SAI2->TCSR & kSAI_FIFOErrorFlag)
	{
		SAI_UserTxIRQHandler(SAI2);
	}

	if (SAI2->RCSR & kSAI_FIFOErrorFlag)
	{
		SAI_UserRxIRQHandler(SAI2);
	}
}
void SAI3_TX_IRQHandler(void)
{
	if (SAI3->TCSR & kSAI_FIFOErrorFlag)
	{
		SAI_UserTxIRQHandler(SAI3);
	}
}
void SAI3_RX_IRQHandler(void)
{
	if (SAI3->RCSR & kSAI_FIFOErrorFlag)
	{
		SAI_UserRxIRQHandler(SAI3);
	}
}

static codec_handle_t s_HndCodec[enNumOfSAI] = {0};
extern codec_config_t boardCodecConfig;

void DrvSAIClockInit(void)
{
	CLOCK_DeinitAudioPll();
	CLOCK_InitAudioPll(&audioPllConfig722534400Hz);

	/*Clock setting for LPI2C*/
	CLOCK_SetMux(kCLOCK_Lpi2cMux, kLPI2CClockSourceSelect);
	CLOCK_SetDiv(kCLOCK_Lpi2cDiv, kLPI2CClockSourceDivider);

	/*Clock setting for SAI*/
	CLOCK_SetMux(kCLOCK_Sai1Mux, kSAIClockSourceSelect);
	CLOCK_SetDiv(kCLOCK_Sai1PreDiv, kSAIClockSourcePreDivider);
	CLOCK_SetDiv(kCLOCK_Sai1Div, kSAIClockSourceDivider);
	CLOCK_SetMux(kCLOCK_Sai2Mux, kSAIClockSourceSelect);
	CLOCK_SetDiv(kCLOCK_Sai2PreDiv, kSAIClockSourcePreDivider);
	CLOCK_SetDiv(kCLOCK_Sai2Div, kSAIClockSourceDivider);
	CLOCK_SetMux(kCLOCK_Sai3Mux, kSAIClockSourceSelect);
	CLOCK_SetDiv(kCLOCK_Sai3PreDiv, kSAIClockSourcePreDivider);
	CLOCK_SetDiv(kCLOCK_Sai3Div, kSAIClockSourceDivider);

	/*Enable MCLK clock*/
	EnableSaiMclkOutput(enSAI1, true);
}

static sai_word_width_t s_sai_word_width[enNumOfSAI] = {0};
static sai_sample_rate_t s_sai_sample_rate[enNumOfSAI] = {0};

_Bool DrvSAIDMAInit(enSAI_t enSAI)
{
	{ /** Init DMA/DMAMUX */
		edma_config_t dmaConfig = {0};
		EDMA_Deinit(DMA0);
		DMAMUX_Deinit(DMAMUX);
		/* Create EDMA handle */
		/*
		* dmaConfig.enableRoundRobinArbitration = false;
		* dmaConfig.enableHaltOnError = true;
		* dmaConfig.enableContinuousLinkMode = false;
		* dmaConfig.enableDebugMode = false;
		*/
		EDMA_GetDefaultConfig(&dmaConfig);
		EDMA_Init(DMA0, &dmaConfig);
		EDMA_ResetChannel(DMA0, kDmaTxChannel[enSAI]);
		EDMA_ResetChannel(DMA0, kDmaRxChannel[enSAI]);
		DMAMUX_Init(DMAMUX);
	}
	EDMA_CreateHandle(&s_hndDmaTx[enSAI], kDMA, kDmaTxChannel[enSAI]);
	EDMA_CreateHandle(&s_hndDmaRx[enSAI], kDMA, kDmaRxChannel[enSAI]);

	DMAMUX_SetSource(kDMAMUX, kDmaTxChannel[enSAI], (uint8_t)s_DmaRequestMuxSaiTx[enSAI]);
	DMAMUX_EnableChannel(kDMAMUX, kDmaTxChannel[enSAI]);
	DMAMUX_SetSource(kDMAMUX, kDmaRxChannel[enSAI], (uint8_t)s_DmaRequestMuxSaiRx[enSAI]);
	DMAMUX_EnableChannel(kDMAMUX, kDmaRxChannel[enSAI]);

	return true;
}

#include "arm_math.h"

_Bool DrvSAIInit(enSAI_t enSAI, sai_sample_rate_t enSampleRate, sai_word_width_t enPcmBit, _Bool bRec)
{
	I2S_Type *base[enNumOfSAI] = {SAI1, SAI2};
	const uint32_t TxIrq[enNumOfSAI] = {SAI1_IRQn, SAI2_IRQn};
	const uint32_t RxIrq[enNumOfSAI] = {SAI1_IRQn, SAI2_IRQn};
	const clock_div_t SaiDiv[enNumOfSAI] = {kCLOCK_Sai1Div, kCLOCK_Sai2Div};
	uint32_t SaiDivVal = 0;

	sai_config_t config;

	sai_transfer_format_t format = {0};
	uint32_t u32BclkSrcHz = 0;
	status_t sts;

	if ((enSAI < enSAI1) || (enSAI >= enNumOfSAI))
	{
		return false;
	}
	if ((enSampleRate < kSAI_SampleRate8KHz) || (enSampleRate > kSAI_SampleRate96KHz))
	{
		return false;
	}
	if ((enPcmBit < kSAI_WordWidth8bits) || (enPcmBit > kSAI_WordWidth32bits))
	{
		return false;
	}

	s_sai_word_width[enSAI] = enPcmBit;

	/* buffer size is 64 sample */
	if (s_sai_word_width[enSAI] == kSAI_WordWidth24bits)
	{
		s_u32EDMATxBufSize[enSAI] = DEF_BUFFER_SAMPLE_SIZE * 4;
		s_u32EDMARxBufSize[enSAI] = DEF_BUFFER_SAMPLE_SIZE * 4;
	}
	else
	{
		s_u32EDMATxBufSize[enSAI] = DEF_BUFFER_SAMPLE_SIZE * (enPcmBit / 8);
		s_u32EDMARxBufSize[enSAI] = DEF_BUFFER_SAMPLE_SIZE * (enPcmBit / 8);
	}
	mimic_printf("[%s (%d)] s_u32EDMATxBufSize[%d] = %lu\r\n", __func__, __LINE__, enSAI, s_u32EDMATxBufSize[enSAI]);
	mimic_printf("[%s (%d)] s_u32EDMARxBufSize[%d] = %lu\r\n", __func__, __LINE__, enSAI, s_u32EDMARxBufSize[enSAI]);
	
	EnableSaiMclkOutput(enSAI1, false);
	CLOCK_DeinitAudioPll();
	s_sai_sample_rate[enSAI] = enSampleRate;
	switch (enSampleRate)
	{
	case kSAI_SampleRate11025Hz:
	case kSAI_SampleRate22050Hz:
	case kSAI_SampleRate44100Hz:
		CLOCK_InitAudioPll(&audioPllConfig722534400Hz);
		break;
	default:
		CLOCK_InitAudioPll(&audioPllConfig786432000Hz);
		break;
	}
	switch (enSampleRate)
	{
	case kSAI_SampleRate96KHz:
		SaiDivVal = 31;
		break;
	default:
		SaiDivVal = 63;
		break;
	}
	CLOCK_SetDiv(SaiDiv[enSAI], SaiDivVal);
	EnableSaiMclkOutput(enSAI1, true);

	{
		//		static _Bool s_bInited = false;
		//		if(s_bInited == false){
		//			s_bInited = true;
		DrvSAIDMAInit(enSAI);
		//		}
	}

	SAI_Deinit(base[enSAI]);
	memset(s_TxAudioBuff[enSAI], 0, sizeof(s_TxAudioBuff[enSAI]));
	memset(s_RxAudioBuff[enSAI], 0, sizeof(s_RxAudioBuff[enSAI]));
	/* Init SAI module */
	/*
     * config.masterSlave = kSAI_Master;
     * config.mclkSource = kSAI_MclkSourceSysclk;
     * config.protocol = kSAI_BusLeftJustified;
     * config.syncMode = kSAI_ModeAsync;
     * config.mclkOutputEnable = true;
     */
	SAI_TxGetDefaultConfig(&config);
	SAI_TxInit(base[enSAI], &config);

